ruby/G.org
#+TITLE:     G
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>



* [[https://wordsinasentence.com/gainsay-in-a-sentence/][Gainsay]]

  =to contradict or deny=

  - Since Jack told the truth on the witness stand, no one was able to gainsay his statement.
  - It would be unwise of you to gainsay your doctor’s medical suggestions and stop taking your prescriptions.
  - To gainsay the contributions of immigrants to our nation would be the same as denying the unique voices of our diverse population.
  - It is impossible to gainsay the importance of a good education in today’s competitive job market.
  - The athlete was unable to gainsay his positive drug test.
  - How dare you gainsay the professor’s opinion when you know so little about DNA replication!
  - After the lab experiments, the scientist could not gainsay the ineffectiveness of the drug which had not destroyed the cancer cells.



* [[https://wordsinasentence.com/gall-in-a-sentence/][Gall]]

  =daring conduct=

  - After Paul made the mistake, he had the gall to blame me for his error.
  - Can you believe Amber had the gall to call her parents controlling after they bailed her out of jail?
  - Even though Janice owes us money, she still has the gall to brag about buying a ticket to the baseball game.
  - Ted had the gall to ask his wife for a divorce after she worked tirelessly to *put him through* =使通过= medical school.
  - Unfortunately, John is often mistreated at work because he does not have the gall to stand up for himself.
  - Elaine had the gall to order the most expensive meal in the restaurant because she knew I was paying.
  - After begging to meet with the attorney, Sheila had the gall to show up an hour late.



* [[https://wordsinasentence.com/gallant-in-a-sentence/][Gallant]]

  =fearless and daring=

  - Despite being outnumbered the gallant soldiers were eager for battle.
  - The rookie fighter put on a gallant display but still lost the match to his experienced competitor.
  - Unfortunately the fireman’s gallant effort to save the woman came too late.
  - The gallant knight showed no fear as he raced towards the dragon.



* [[https://wordsinasentence.com/galvanize-in-a-sentence/][Galvanize]]

  =to inspire people to work towards change=

  - Do you think the child’s death will galvanize town residents to the point they will stand up to drug dealers?
  - By holding a rally, the politician hoped to galvanize young people to vote.
  - The infection will galvanize your white blood cells and trigger your immune reactions.
  - Because the charity wants to galvanize the public in support of its cause, it’s holding an open house to share its achievements and goals.



