ruby/G.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-14 Thu 23:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>G</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">G</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ea6e43">1. Gainsay</a></li>
<li><a href="#org339d3dd">2. Gall</a></li>
<li><a href="#orgfa12f2c">3. Gallant</a></li>
<li><a href="#org61d52e7">4. Galvanize</a></li>
<li><a href="#org6fe6488">5. Garble</a></li>
<li><a href="#orgcb6e291">6. Garish</a></li>
<li><a href="#orgb422314">7. Garrulous</a></li>
<li><a href="#orgb66aa16">8. Gaudy</a></li>
<li><a href="#org81de86b">9. Genial</a></li>
<li><a href="#org91af603">10. Genus</a></li>
<li><a href="#orgd5ee0ed">11. Germinate</a></li>
<li><a href="#org40cff6c">12. Gibe</a></li>
<li><a href="#orgae3a878">13. Giddy</a></li>
<li><a href="#org77a9aa1">14. Gloat</a></li>
<li><a href="#org7b88552">15. Gloom</a></li>
<li><a href="#orgb68e85d">16. Glutinous</a></li>
<li><a href="#org97cea37">17. Graft</a></li>
<li><a href="#org95e960e">18. Grandiloquent</a></li>
<li><a href="#orga772c76">19. Grandiose</a></li>
<li><a href="#orgd5f4a88">20. Gratify</a></li>
<li><a href="#org0746e39">21. Gratuitous</a></li>
<li><a href="#orgd094da1">22. Grim</a></li>
<li><a href="#org4e70e2f">23. Grind</a></li>
<li><a href="#org7417e1b">24. Grope</a></li>
<li><a href="#orge17329b">25. Grudge</a></li>
<li><a href="#org0ad26d2">26. Grumble</a></li>
<li><a href="#org9ef5a63">27. Guile</a></li>
<li><a href="#orgbb64959">28. Gullible</a></li>
<li><a href="#org80632b5">29. Gush</a></li>
<li><a href="#org144b114">30. Gabble</a></li>
<li><a href="#org22b0add">31. Gaffe</a></li>
<li><a href="#org496c19d">32. Gaiety</a></li>
<li><a href="#orge86523a">33. Gambol</a></li>
<li><a href="#org49de9bf">34. Gape</a></li>
<li><a href="#orgcfd643b">35. Garble</a></li>
<li><a href="#orgcb3479f">36. Gargantuan</a></li>
<li><a href="#orga96453e">37. Gargoyle</a></li>
<li><a href="#org151510d">38. Garner</a></li>
<li><a href="#org53af6cd">39. Garnish</a></li>
<li><a href="#org8d45389">40. Garrulous</a></li>
<li><a href="#org6ea03f2">41. Gaseous</a></li>
<li><a href="#org3d632b4">42. Gauche</a></li>
<li><a href="#org33ec942">43. Gaunt</a></li>
<li><a href="#org7d50c4d">44. Gawk</a></li>
<li><a href="#orga303563">45. Genteel</a></li>
<li><a href="#org64eebf3">46. Gesticulate</a></li>
<li><a href="#orgf755622">47. Gild</a></li>
<li><a href="#org10db4e5">48. Gingerly</a></li>
<li><a href="#org0226005">49. Gist</a></li>
<li><a href="#org80bca21">50. Glare</a></li>
<li><a href="#org54e5a83">51. Gleam</a></li>
<li><a href="#org8558210">52. Glean</a></li>
<li><a href="#org4bb8791">53. Glee</a></li>
<li><a href="#orgf3be987">54. Glib</a></li>
<li><a href="#orgb9ef252">55. Glimmer</a></li>
<li><a href="#org5ded891">56. Glisten</a></li>
<li><a href="#org43ea3c7">57. Glitter</a></li>
<li><a href="#orgc90c930">58. Gloomy</a></li>
<li><a href="#org9c4dc94">59. Glower</a></li>
<li><a href="#orgfd966f9">60. Gnaw</a></li>
<li><a href="#orga53a072">61. Goad</a></li>
<li><a href="#orgadb6d0c">62. Gobbledygook</a></li>
<li><a href="#org3a0deae">63. Gorge</a></li>
<li><a href="#org7bdeecf">64. Gracious</a></li>
<li><a href="#orgdd2ed75">65. Grate</a></li>
<li><a href="#org111cf9c">66. Grimace</a></li>
<li><a href="#org175981d">67. Grin</a></li>
<li><a href="#org7a006e3">68. Gripe</a></li>
<li><a href="#org0de25e3">69. Grisly</a></li>
<li><a href="#org6cbb5a0">70. Grit</a></li>
<li><a href="#org3016f12">71. Groan</a></li>
<li><a href="#orgb471950">72. Grotesque</a></li>
<li><a href="#orgeb43170">73. Grouch</a></li>
<li><a href="#org3c2e046">74. Grove</a></li>
<li><a href="#orge17ff4a">75. Grovel</a></li>
<li><a href="#orgcdca6c6">76. Growl</a></li>
<li><a href="#org3dec587">77. Gruesome</a></li>
<li><a href="#org84b685e">78. Gruff</a></li>
<li><a href="#orge540571">79. Grumpy</a></li>
<li><a href="#org7a6c6b5">80. Guileless</a></li>
<li><a href="#org98243e1">81. Guise</a></li>
<li><a href="#org62b2e5d">82. Gumption</a></li>
<li><a href="#orgd3b3367">83. Gustatory</a></li>
<li><a href="#org903f90d">84. Gyrate</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ea6e43">1. Gainsay</a></li>
<li><a href="#org339d3dd">2. Gall</a></li>
<li><a href="#orgfa12f2c">3. Gallant</a></li>
<li><a href="#org61d52e7">4. Galvanize</a></li>
<li><a href="#org6fe6488">5. Garble</a></li>
<li><a href="#orgcb6e291">6. Garish</a></li>
<li><a href="#orgb422314">7. Garrulous</a></li>
<li><a href="#orgb66aa16">8. Gaudy</a></li>
<li><a href="#org81de86b">9. Genial</a></li>
<li><a href="#org91af603">10. Genus</a></li>
<li><a href="#orgd5ee0ed">11. Germinate</a></li>
<li><a href="#org40cff6c">12. Gibe</a></li>
<li><a href="#orgae3a878">13. Giddy</a></li>
<li><a href="#org77a9aa1">14. Gloat</a></li>
<li><a href="#org7b88552">15. Gloom</a></li>
<li><a href="#orgb68e85d">16. Glutinous</a></li>
<li><a href="#org97cea37">17. Graft</a></li>
<li><a href="#org95e960e">18. Grandiloquent</a></li>
<li><a href="#orga772c76">19. Grandiose</a></li>
<li><a href="#orgd5f4a88">20. Gratify</a></li>
<li><a href="#org0746e39">21. Gratuitous</a></li>
<li><a href="#orgd094da1">22. Grim</a></li>
<li><a href="#org4e70e2f">23. Grind</a></li>
<li><a href="#org7417e1b">24. Grope</a></li>
<li><a href="#orge17329b">25. Grudge</a></li>
<li><a href="#org0ad26d2">26. Grumble</a></li>
<li><a href="#org9ef5a63">27. Guile</a></li>
<li><a href="#orgbb64959">28. Gullible</a></li>
<li><a href="#org80632b5">29. Gush</a></li>
<li><a href="#org144b114">30. Gabble</a></li>
<li><a href="#org22b0add">31. Gaffe</a></li>
<li><a href="#org496c19d">32. Gaiety</a></li>
<li><a href="#orge86523a">33. Gambol</a></li>
<li><a href="#org49de9bf">34. Gape</a></li>
<li><a href="#orgcfd643b">35. Garble</a></li>
<li><a href="#orgcb3479f">36. Gargantuan</a></li>
<li><a href="#orga96453e">37. Gargoyle</a></li>
<li><a href="#org151510d">38. Garner</a></li>
<li><a href="#org53af6cd">39. Garnish</a></li>
<li><a href="#org8d45389">40. Garrulous</a></li>
<li><a href="#org6ea03f2">41. Gaseous</a></li>
<li><a href="#org3d632b4">42. Gauche</a></li>
<li><a href="#org33ec942">43. Gaunt</a></li>
<li><a href="#org7d50c4d">44. Gawk</a></li>
<li><a href="#orga303563">45. Genteel</a></li>
<li><a href="#org64eebf3">46. Gesticulate</a></li>
<li><a href="#orgf755622">47. Gild</a></li>
<li><a href="#org10db4e5">48. Gingerly</a></li>
<li><a href="#org0226005">49. Gist</a></li>
<li><a href="#org80bca21">50. Glare</a></li>
<li><a href="#org54e5a83">51. Gleam</a></li>
<li><a href="#org8558210">52. Glean</a></li>
<li><a href="#org4bb8791">53. Glee</a></li>
<li><a href="#orgf3be987">54. Glib</a></li>
<li><a href="#orgb9ef252">55. Glimmer</a></li>
<li><a href="#org5ded891">56. Glisten</a></li>
<li><a href="#org43ea3c7">57. Glitter</a></li>
<li><a href="#orgc90c930">58. Gloomy</a></li>
<li><a href="#org9c4dc94">59. Glower</a></li>
<li><a href="#orgfd966f9">60. Gnaw</a></li>
<li><a href="#orga53a072">61. Goad</a></li>
<li><a href="#orgadb6d0c">62. Gobbledygook</a></li>
<li><a href="#org3a0deae">63. Gorge</a></li>
<li><a href="#org7bdeecf">64. Gracious</a></li>
<li><a href="#orgdd2ed75">65. Grate</a></li>
<li><a href="#org111cf9c">66. Grimace</a></li>
<li><a href="#org175981d">67. Grin</a></li>
<li><a href="#org7a006e3">68. Gripe</a></li>
<li><a href="#org0de25e3">69. Grisly</a></li>
<li><a href="#org6cbb5a0">70. Grit</a></li>
<li><a href="#org3016f12">71. Groan</a></li>
<li><a href="#orgb471950">72. Grotesque</a></li>
<li><a href="#orgeb43170">73. Grouch</a></li>
<li><a href="#org3c2e046">74. Grove</a></li>
<li><a href="#orge17ff4a">75. Grovel</a></li>
<li><a href="#orgcdca6c6">76. Growl</a></li>
<li><a href="#org3dec587">77. Gruesome</a></li>
<li><a href="#org84b685e">78. Gruff</a></li>
<li><a href="#orge540571">79. Grumpy</a></li>
<li><a href="#org7a6c6b5">80. Guileless</a></li>
<li><a href="#org98243e1">81. Guise</a></li>
<li><a href="#org62b2e5d">82. Gumption</a></li>
<li><a href="#orgd3b3367">83. Gustatory</a></li>
<li><a href="#org903f90d">84. Gyrate</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-14 23:29:59</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>



<div id="outline-container-org6ea6e43" class="outline-2">
<h2 id="org6ea6e43"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/gainsay-in-a-sentence/">Gainsay</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>to contradict or deny</code>
</p>

<ul class="org-ul">
<li>Since Jack told the truth on the witness stand, no one was able to gainsay his statement.</li>
<li>It would be unwise of you to gainsay your doctor’s medical suggestions and stop taking your prescriptions.</li>
<li>To gainsay the contributions of immigrants to our nation would be the same as denying the unique voices of our diverse population.</li>
<li>It is impossible to gainsay the importance of a good education in today’s competitive job market.</li>
<li>The athlete was unable to gainsay his positive drug test.</li>
<li>How dare you gainsay the professor’s opinion when you know so little about DNA replication!</li>
<li>After the lab experiments, the scientist could not gainsay the ineffectiveness of the drug which had not destroyed the cancer cells.</li>
</ul>
</div>
</div>



<div id="outline-container-org339d3dd" class="outline-2">
<h2 id="org339d3dd"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/gall-in-a-sentence/">Gall</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>daring conduct</code>
</p>

<ul class="org-ul">
<li>After Paul made the mistake, he had the gall to blame me for his error.</li>
<li>Can you believe Amber had the gall to call her parents controlling after they bailed her out of jail?</li>
<li>Even though Janice owes us money, she still has the gall to brag about buying a ticket to the baseball game.</li>
<li>Ted had the gall to ask his wife for a divorce after she worked tirelessly to put him through medical school.</li>
<li>Unfortunately, John is often mistreated at work because he does not have the gall to stand up for himself.</li>
<li>Elaine had the gall to order the most expensive meal in the restaurant because she knew I was paying.</li>
<li>After begging to meet with the attorney, Sheila had the gall to show up an hour late.</li>
</ul>
</div>
</div>



<div id="outline-container-orgfa12f2c" class="outline-2">
<h2 id="orgfa12f2c"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/gallant-in-a-sentence/">Gallant</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>fearless and daring</code>
</p>

<ul class="org-ul">
<li>Despite being outnumbered the gallant soldiers were eager for battle.</li>
<li>The rookie fighter put on a gallant display but still lost the match to his experienced competitor.</li>
<li>Unfortunately the fireman’s gallant effort to save the woman came too late.</li>
<li>The gallant knight showed no fear as he raced towards the dragon.</li>
</ul>
</div>
</div>



<div id="outline-container-org61d52e7" class="outline-2">
<h2 id="org61d52e7"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/galvanize-in-a-sentence/">Galvanize</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>to inspire people to work towards change</code>
</p>

<ul class="org-ul">
<li>Do you think the child’s death will galvanize town residents to the point they will stand up to drug dealers?</li>
<li>By holding a rally, the politician hoped to galvanize young people to vote.</li>
<li>The infection will galvanize your white blood cells and trigger your immune reactions.</li>
<li>Because the charity wants to galvanize the public in support of its cause, it’s holding an open house to share its achievements and goals.</li>
</ul>
</div>
</div>
