ruby/G.org
* [[https://wordsinasentence.com/garble-in-a-sentence/][Garble]]

  =to alter the sound or meaning of something=

  - The drunk man will often garble his words to the point that they are not understandable.
  - If you do not garble the directions and confuse me, I should be able to easily find your house.
  - The boy started to garble the poem when he could not remember the words.
  - Because the writer believed making changes to his novel would garble his message, he decided to keep the book as it was.



* [[https://wordsinasentence.com/garish-in-a-sentence/][Garish]]

  =something that is elaborate, showy, striking and in bad taste=

  - Because she likes showing off her money, my wealthy aunt is known for wearing garish jewelry to casual events.
  - Rappers are known for wearing garish accessories like giant gold chains.
  - After the renovations were completed in the old church, many considered the changes to be garish and out of place.
  - When my sister won the lottery, she purchased a garish sports car which could not be missed on the highway.
  - Because my friend’s outfit was so garish, the principal sent her home to change into more appropriate clothes.
  - While Margaret decorated her home in *subdued colors* like tan and pale yellow, her friend Heather preferred garish colors such as bright green and orange.
  - The football player’s wife wore a large garish ring which appeared to cover her entire hand.



* [[https://wordsinasentence.com/garrulous-in-a-sentence/][Garrulous]]

  =overly talkative and chatty, mostly about unimportant things=

  - Desperate for peace and quiet, Amanda told the garrulous man sitting next to her to "Shut up!"
  - The garrulous gentleman held up the checkout line as he rambled on to the cashier about his pet squirrel.
  - Mom, who is usually loud and garrulous, was surprisingly quiet as a mouse this morning.
  - Because Jake is garrulous, asking him to keep a secret is impossible.
  - Garrulous people make great talk show hosts.
  - If the garrulous car salesman *prattles on* with his *small talk*, I'll buy a car elsewhere.
  - Though my window is closed, I can still hear my garrulous neighbors loudly gossip in the night.



* [[https://wordsinasentence.com/gaudy-in-a-sentence/][Gaudy]]

  =so showy that it is unattractive=

  - When Crystal returned from the nail salon, she showed me her gaudy nails that were painted bright orange.
  - The colorful performer is known for his gaudy fashion taste.
  - As I watched the pageant, the number of little girls in inappropriate gaudy dresses and makeup shocked me.
  - There was no way I was going to hang that gaudy painting on the wall of my new house.
  - Last night, we drove by a house that was covered in what had to be a thousand gaudy Christmas lights.
  - Gina did not listen when we told her dyeing her hair pink and orange would be a gaudy style move.
  - As soon as the single man won the lottery, he purchased a huge house and decorated it with gaudy gold statues of himself.



* [[https://wordsinasentence.com/genial-in-a-sentence/][Genial]]

  =warm and welcoming=

  - Santa Claus is such a genial man that children love to approach him.
  - While I expected my elderly neighbor to be rude, he was actually genial and invited me in for tea.
  - A glass of wine always makes me genial and approachable.
  - How can I resist such a genial party invitation?
  - The genial clerk warmly greeted me as soon as I walked through the hotel doors.
  - As soon as Matt saw Sarah’s genial smile, he knew he had found the woman of his dreams.
  - The genial atmosphere of the dinner made strangers feel like friends.



* [[https://wordsinasentence.com/genus-in-a-sentence/][Genus]]

  =a genus is a class or group of something, usually used in biology to classify similar animals of different species=

  - Because it represents the group, the genus is the first part of an animal’s scientific name.
  - When discussing the genus, the scientists talked about a set of closely related plants.
  - Felidae is the genus that includes many types of cats including lions and tigers.
  - Because no other animals are similar to a giraffe, it is the only animal classified in its genus.



* [[https://wordsinasentence.com/germinate-in-a-sentence/][Germinate]]

  =to mature or develop=

  - Without sunlight, the seeds will not germinate.
  - The plants need an adequate amount of water to germinate.
  - Because the students were anxious for their plants to germinate, they would not stop looking at the pots in the window.
  - These plants germinate quite fast so you should have a stunning garden in no time.



* [[https://wordsinasentence.com/gibe-in-a-sentence/][Gibe]]

  =an insulting comment=

  - Jack never failed to make a gibe about his ex-boss who married his ex-wife.
  - If you make a gibe about someone else, you should not be surprised if they make an unpleasant remark about you.
  - I knew Vera was not my friend when she made a gibe about my weight.
  - After the singer discovered the reporter had made a gibe about her, she refused to do additional interviews with the magazine.
  - The little boy started to cry when he heard a classmate make a gibe about him.
  - Because Ellen enjoys putting other people down, it is not surprising she made a gibe about the new girl’s outfit.
  - A compliment will work much better than a gibe if you are trying to make a new friend.



* [[https://wordsinasentence.com/giddy-in-a-sentence/][Giddy]]

  =displaying immense happiness=

  - An overindulgence in alcohol made Edith feel giddy enough to dance on the dinner table.
  - Since I love coffee, I was giddy about visiting the famous coffee bean plantation.
  - The greedy banker became giddy when he thought about foreclosing on peoples’ homes.
  - As soon as the dog saw the steak bone, she became giddy and started wagging her tail.



