ruby/G.html



<div id="outline-container-org6fe6488" class="outline-2">
<h2 id="org6fe6488"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/garble-in-a-sentence/">Garble</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>to alter the sound or meaning of something</code>
</p>

<ul class="org-ul">
<li>The drunk man will often garble his words to the point that they are not understandable.</li>
<li>If you do not garble the directions and confuse me, I should be able to easily find your house.</li>
<li>The boy started to garble the poem when he could not remember the words.</li>
<li>Because the writer believed making changes to his novel would garble his message, he decided to keep the book as it was.</li>
</ul>
</div>
</div>



<div id="outline-container-orgcb6e291" class="outline-2">
<h2 id="orgcb6e291"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/garish-in-a-sentence/">Garish</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>something that is elaborate, showy, striking and in bad taste</code>
</p>

<ul class="org-ul">
<li>Because she likes showing off her money, my wealthy aunt is known for wearing garish jewelry to casual events.</li>
<li>Rappers are known for wearing garish accessories like giant gold chains.</li>
<li>After the renovations were completed in the old church, many considered the changes to be garish and out of place.</li>
<li>When my sister won the lottery, she purchased a garish sports car which could not be missed on the highway.</li>
<li>Because my friend’s outfit was so garish, the principal sent her home to change into more appropriate clothes.</li>
<li>While Margaret decorated her home in subdued colors like tan and pale yellow, her friend Heather preferred garish colors such as bright green and orange.</li>
<li>The football player’s wife wore a large garish ring which appeared to cover her entire hand.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb422314" class="outline-2">
<h2 id="orgb422314"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/garrulous-in-a-sentence/">Garrulous</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>overly talkative and chatty, mostly about unimportant things</code>
</p>

<ul class="org-ul">
<li>Desperate for peace and quiet, Amanda told the garrulous man sitting next to her to "Shut up!"</li>
<li>The garrulous gentleman held up the checkout line as he rambled on to the cashier about his pet squirrel.</li>
<li>Mom, who is usually loud and garrulous, was surprisingly quiet as a mouse this morning.</li>
<li>Because Jake is garrulous, asking him to keep a secret is impossible.</li>
<li>Garrulous people make great talk show hosts.</li>
<li>If the garrulous car salesman prattles on with his small talk, I'll buy a car elsewhere.</li>
<li>Though my window is closed, I can still hear my garrulous neighbors loudly gossip in the night.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb66aa16" class="outline-2">
<h2 id="orgb66aa16"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/gaudy-in-a-sentence/">Gaudy</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>so showy that it is unattractive</code>
</p>

<ul class="org-ul">
<li>When Crystal returned from the nail salon, she showed me her gaudy nails that were painted bright orange.</li>
<li>The colorful performer is known for his gaudy fashion taste.</li>
<li>As I watched the pageant, the number of little girls in inappropriate gaudy dresses and makeup shocked me.</li>
<li>There was no way I was going to hang that gaudy painting on the wall of my new house.</li>
<li>Last night, we drove by a house that was covered in what had to be a thousand gaudy Christmas lights.</li>
<li>Gina did not listen when we told her dyeing her hair pink and orange would be a gaudy style move.</li>
<li>As soon as the single man won the lottery, he purchased a huge house and decorated it with gaudy gold statues of himself.</li>
</ul>
</div>
</div>



<div id="outline-container-org81de86b" class="outline-2">
<h2 id="org81de86b"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/genial-in-a-sentence/">Genial</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>warm and welcoming</code>
</p>

<ul class="org-ul">
<li>Santa Claus is such a genial man that children love to approach him.</li>
<li>While I expected my elderly neighbor to be rude, he was actually genial and invited me in for tea.</li>
<li>A glass of wine always makes me genial and approachable.</li>
<li>How can I resist such a genial party invitation?</li>
<li>The genial clerk warmly greeted me as soon as I walked through the hotel doors.</li>
<li>As soon as Matt saw Sarah’s genial smile, he knew he had found the woman of his dreams.</li>
<li>The genial atmosphere of the dinner made strangers feel like friends.</li>
</ul>
</div>
</div>



<div id="outline-container-org91af603" class="outline-2">
<h2 id="org91af603"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/genus-in-a-sentence/">Genus</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>a genus is a class or group of something, usually used in biology to classify similar animals of different species</code>
</p>

<ul class="org-ul">
<li>Because it represents the group, the genus is the first part of an animal’s scientific name.</li>
<li>When discussing the genus, the scientists talked about a set of closely related plants.</li>
<li>Felidae is the genus that includes many types of cats including lions and tigers.</li>
<li>Because no other animals are similar to a giraffe, it is the only animal classified in its genus.</li>
</ul>
</div>
</div>



<div id="outline-container-orgd5ee0ed" class="outline-2">
<h2 id="orgd5ee0ed"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/germinate-in-a-sentence/">Germinate</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>to mature or develop</code>
</p>

<ul class="org-ul">
<li>Without sunlight, the seeds will not germinate.</li>
<li>The plants need an adequate amount of water to germinate.</li>
<li>Because the students were anxious for their plants to germinate, they would not stop looking at the pots in the window.</li>
<li>These plants germinate quite fast so you should have a stunning garden in no time.</li>
</ul>
</div>
</div>



<div id="outline-container-org40cff6c" class="outline-2">
<h2 id="org40cff6c"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/gibe-in-a-sentence/">Gibe</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>an insulting comment</code>
</p>

<ul class="org-ul">
<li>Jack never failed to make a gibe about his ex-boss who married his ex-wife.</li>
<li>If you make a gibe about someone else, you should not be surprised if they make an unpleasant remark about you.</li>
<li>I knew Vera was not my friend when she made a gibe about my weight.</li>
<li>After the singer discovered the reporter had made a gibe about her, she refused to do additional interviews with the magazine.</li>
<li>The little boy started to cry when he heard a classmate make a gibe about him.</li>
<li>Because Ellen enjoys putting other people down, it is not surprising she made a gibe about the new girl’s outfit.</li>
<li>A compliment will work much better than a gibe if you are trying to make a new friend.</li>
</ul>
</div>
</div>



<div id="outline-container-orgae3a878" class="outline-2">
<h2 id="orgae3a878"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/giddy-in-a-sentence/">Giddy</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>displaying immense happiness</code>
</p>

<ul class="org-ul">
<li>An overindulgence in alcohol made Edith feel giddy enough to dance on the dinner table.</li>
<li>Since I love coffee, I was giddy about visiting the famous coffee bean plantation.</li>
<li>The greedy banker became giddy when he thought about foreclosing on peoples’ homes.</li>
<li>As soon as the dog saw the steak bone, she became giddy and started wagging her tail.</li>
</ul>
</div>
</div>
