ruby/G.org
* [[https://wordsinasentence.com/gloat-in-a-sentence-2/][Gloat]]

  =to take satisfaction in something that makes another person seem inferior=

  - If you are the winner of a contest, you should not gloat and make your competitors feel inferior.
  - The winning team was polite enough to not gloat over its huge win.
  - Since we play the championship game in two days, we do not have time to gloat over our victory.
  - It was rude of the wealthy girl to gloat over her expensive Christmas gifts while volunteering at a homeless shelter.
  - Although I was right about the solution, I chose not to gloat over my classmate’s wrong answer.
  - Whenever the football player scores a touchdown, he chooses to gloat by dancing and pointing a finger at a rival player.
  - During the game, the annoying fan did nothing but gloat about his team’s huge lead.



* [[https://wordsinasentence.com/gloom-in-a-sentence/][Gloom]]

  =a poorly lit and hard to see through=

  - Tommy stumbled through the gloom in his dark room and nearly tripped over his shoes.
  - The diver swam in the gloom of the deep ocean and could not see more than a few inches in front of him.
  - Maya could barely see the moon through the gloom of the dark night and wall of clouds.
  - The old house was filled with gloom that was only slightly brightened by the candlelight.



* [[https://wordsinasentence.com/glutinous-in-a-sentence/][Glutinous]]

  =sticky or gooey=

  - Wading through glutinous mud caused the hunters to *get bogged down* and their boots stuck.
  - I enjoyed my mother’s brownies, but the glutinous batter was a little too gooey for my taste.
  - During the science lab, the students created a glutinous mixture that was gooey enough to stick to the walls when thrown.
  - A glutinous paste was applied to the back of the contact paper so that it would stick firmly to the cabinets.




* [[https://wordsinasentence.com/graft-in-a-sentence/][Graft]]

  =corruption, specifically use of a politician's authority for personal gain=

  - Many people believe the president is guilty of graft since his personal businesses will indeed benefit from his political position.
  - Convictions for graft were rare, even though politicians regularly *lined their pockets* =受贿= with taxpayer money.
  - Fraud and graft allegations were directed at the greedy senator who accepted bribes for his vote.
  - Though he denied the graft allegations, a judge ruled that the politician was indeed guilty of corrupt business practices fueled by his position of power.



* [[https://wordsinasentence.com/grandiloquent-in-a-sentence/][Grandiloquent]]

  =prone to using sophisticated language in order to impress people=

  - Even though Rick did not understand the grandiloquent words, he still used them to impress his wealthy friends.
  - The city girl’s grandiloquent talk was confusing to the people in the country town.
  - When I heard the salesman’s grandiloquent speech, I knew he was trying to make the car deal sound better than it actually was.
  - Jack’s use of grandiloquent terminology failed to impress the job interviewer.
  - Because the politician made grandiloquent speeches too sophisticated for voters to understand, he did not fair well in the polls.
  - Bill’s grandiloquent conversation made him seem out of place among the uneducated workers.
  - When the president spoke, he talked in such grandiloquent terms the public never grasped his plans.



* [[https://wordsinasentence.com/grandiose-in-a-sentence/][Grandiose]]

  =appearing to be impressive but not really possible or practical=

  - The idea of throwing a party on top of the swimming pool seemed quite grandiose to everyone in the room.
  - When the drug company announced its new weight-loss product, it made some grandiose promises about instant weight reduction.
  - Uncle Adam is prone to making grandiose statements about his wealth when he is drunk.
  - After hearing about the grandiose eight-bedroom house, I decided it was way too big for a family of three.
  - Why would anyone want to build a grandiose office building in such a tiny town?
  - Because I want the party to be a grandiose affair, I am using all of my savings to have the event catered by a famous chef.
  - The lottery commercials appeal to consumers by leading them to believe they too can have grandiose lives filled with champagne parties and limousine rides.



* [[https://wordsinasentence.com/gratify-in-a-sentence/][Gratify]]

  =to satisfy or make content=

  - Hopefully the chocolate bar will gratify my desire for something sweet.
  - After the minister was caught trying to gratify his sexual desires with a prostitute, he was dismissed from his church leadership role.
  - The lounge singer hoped to gratify audience members by taking requests for their favorite songs.
  - Even though I know people often criticize my clothing choices, I only dress to gratify myself.



* [[https://wordsinasentence.com/gratuitous-in-a-sentence/][Gratuitous]]

  =uncalled for; unwarranted; unnecessary=

  - Even though I had been looking forward to seeing the movie, I walked out of the theater after thirty minutes because of so much gratuitous foul language.
  - Since her son had already served his hours of community service for the vandalism, Selena thought that the school’s additional punishment was gratuitous.
  - He’s always looking for gratuitous attention from his classmates by pulling all sorts of reckless stunts.
  - That director specializes in the gratuitous exploitation of people’s worst nightmares in his horror films.
  - Despite coming in at third place, he indulged in some gratuitous self-glorification, to the dismay of all his friends.
  - The novel contains a great deal of gratuitous speculation and opinion that make it very difficult to follow the plot.
  - Although the candidate felt that the interview had gone in his favor, he didn’t *make the cut* =入选= because the committee was so irritated by his gratuitous bragging.



* [[https://wordsinasentence.com/grim-in-a-sentence/][Grim]]

  =dreary; miserable=

  - The soldiers were grim after losing many of their comrades in battle.
  - Because the weather is grim, we are staying inside our home.
  - It was obvious from the students’ grim faces they were not happy about the pop quiz.
  - When Heather saw the grim look on her supervisor’s face, she knew her job was in jeopardy.



