ruby/G.html



<div id="outline-container-org77a9aa1" class="outline-2">
<h2 id="org77a9aa1"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/gloat-in-a-sentence-2/">Gloat</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>to take satisfaction in something that makes another person seem inferior</code>
</p>

<ul class="org-ul">
<li>If you are the winner of a contest, you should not gloat and make your competitors feel inferior.</li>
<li>The winning team was polite enough to not gloat over its huge win.</li>
<li>Since we play the championship game in two days, we do not have time to gloat over our victory.</li>
<li>It was rude of the wealthy girl to gloat over her expensive Christmas gifts while volunteering at a homeless shelter.</li>
<li>Although I was right about the solution, I chose not to gloat over my classmate’s wrong answer.</li>
<li>Whenever the football player scores a touchdown, he chooses to gloat by dancing and pointing a finger at a rival player.</li>
<li>During the game, the annoying fan did nothing but gloat about his team’s huge lead.</li>
</ul>
</div>
</div>



<div id="outline-container-org7b88552" class="outline-2">
<h2 id="org7b88552"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/gloom-in-a-sentence/">Gloom</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>a poorly lit and hard to see through</code>
</p>

<ul class="org-ul">
<li>Tommy stumbled through the gloom in his dark room and nearly tripped over his shoes.</li>
<li>The diver swam in the gloom of the deep ocean and could not see more than a few inches in front of him.</li>
<li>Maya could barely see the moon through the gloom of the dark night and wall of clouds.</li>
<li>The old house was filled with gloom that was only slightly brightened by the candlelight.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb68e85d" class="outline-2">
<h2 id="orgb68e85d"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/glutinous-in-a-sentence/">Glutinous</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>sticky or gooey</code>
</p>

<ul class="org-ul">
<li>Wading through glutinous mud caused the hunters to get bogged down and their boots stuck.</li>
<li>I enjoyed my mother’s brownies, but the glutinous batter was a little too gooey for my taste.</li>
<li>During the science lab, the students created a glutinous mixture that was gooey enough to stick to the walls when thrown.</li>
<li>A glutinous paste was applied to the back of the contact paper so that it would stick firmly to the cabinets.</li>
</ul>
</div>
</div>




<div id="outline-container-org97cea37" class="outline-2">
<h2 id="org97cea37"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/graft-in-a-sentence/">Graft</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>corruption, specifically use of a politician's authority for personal gain</code>
</p>

<ul class="org-ul">
<li>Many people believe the president is guilty of graft since his personal businesses will indeed benefit from his political position.</li>
<li>Convictions for graft were rare, even though politicians regularly lined their pockets with taxpayer money.</li>
<li>Fraud and graft allegations were directed at the greedy senator who accepted bribes for his vote.</li>
<li>Though he denied the graft allegations, a judge ruled that the politician was indeed guilty of corrupt business practices fueled by his position of power.</li>
</ul>
</div>
</div>



<div id="outline-container-org95e960e" class="outline-2">
<h2 id="org95e960e"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/grandiloquent-in-a-sentence/">Grandiloquent</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>prone to using sophisticated language in order to impress people</code>
</p>

<ul class="org-ul">
<li>Even though Rick did not understand the grandiloquent words, he still used them to impress his wealthy friends.</li>
<li>The city girl’s grandiloquent talk was confusing to the people in the country town.</li>
<li>When I heard the salesman’s grandiloquent speech, I knew he was trying to make the car deal sound better than it actually was.</li>
<li>Jack’s use of grandiloquent terminology failed to impress the job interviewer.</li>
<li>Because the politician made grandiloquent speeches too sophisticated for voters to understand, he did not fair well in the polls.</li>
<li>Bill’s grandiloquent conversation made him seem out of place among the uneducated workers.</li>
<li>When the president spoke, he talked in such grandiloquent terms the public never grasped his plans.</li>
</ul>
</div>
</div>



<div id="outline-container-orga772c76" class="outline-2">
<h2 id="orga772c76"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/grandiose-in-a-sentence/">Grandiose</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>appearing to be impressive but not really possible or practical</code>
</p>

<ul class="org-ul">
<li>The idea of throwing a party on top of the swimming pool seemed quite grandiose to everyone in the room.</li>
<li>When the drug company announced its new weight-loss product, it made some grandiose promises about instant weight reduction.</li>
<li>Uncle Adam is prone to making grandiose statements about his wealth when he is drunk.</li>
<li>After hearing about the grandiose eight-bedroom house, I decided it was way too big for a family of three.</li>
<li>Why would anyone want to build a grandiose office building in such a tiny town?</li>
<li>Because I want the party to be a grandiose affair, I am using all of my savings to have the event catered by a famous chef.</li>
<li>The lottery commercials appeal to consumers by leading them to believe they too can have grandiose lives filled with champagne parties and limousine rides.</li>
</ul>
</div>
</div>



<div id="outline-container-orgd5f4a88" class="outline-2">
<h2 id="orgd5f4a88"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/gratify-in-a-sentence/">Gratify</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>to satisfy or make content</code>
</p>

<ul class="org-ul">
<li>Hopefully the chocolate bar will gratify my desire for something sweet.</li>
<li>After the minister was caught trying to gratify his sexual desires with a prostitute, he was dismissed from his church leadership role.</li>
<li>The lounge singer hoped to gratify audience members by taking requests for their favorite songs.</li>
<li>Even though I know people often criticize my clothing choices, I only dress to gratify myself.</li>
</ul>
</div>
</div>



<div id="outline-container-org0746e39" class="outline-2">
<h2 id="org0746e39"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/gratuitous-in-a-sentence/">Gratuitous</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>uncalled for; unwarranted; unnecessary</code>
</p>

<ul class="org-ul">
<li>Even though I had been looking forward to seeing the movie, I walked out of the theater after thirty minutes because of so much gratuitous foul language.</li>
<li>Since her son had already served his hours of community service for the vandalism, Selena thought that the school’s additional punishment was gratuitous.</li>
<li>He’s always looking for gratuitous attention from his classmates by pulling all sorts of reckless stunts.</li>
<li>That director specializes in the gratuitous exploitation of people’s worst nightmares in his horror films.</li>
<li>Despite coming in at third place, he indulged in some gratuitous self-glorification, to the dismay of all his friends.</li>
<li>The novel contains a great deal of gratuitous speculation and opinion that make it very difficult to follow the plot.</li>
<li>Although the candidate felt that the interview had gone in his favor, he didn’t make the cut because the committee was so irritated by his gratuitous bragging.</li>
</ul>
</div>
</div>



<div id="outline-container-orgd094da1" class="outline-2">
<h2 id="orgd094da1"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/grim-in-a-sentence/">Grim</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>dreary; miserable</code>
</p>

<ul class="org-ul">
<li>The soldiers were grim after losing many of their comrades in battle.</li>
<li>Because the weather is grim, we are staying inside our home.</li>
<li>It was obvious from the students’ grim faces they were not happy about the pop quiz.</li>
<li>When Heather saw the grim look on her supervisor’s face, she knew her job was in jeopardy.</li>
</ul>
</div>
</div>
