ruby/G.org
* [[https://wordsinasentence.com/grind-in-a-sentence/][Grind]]

  =to crush something into small pieces=

  - Using a machine to grind the coffee beans took a lot less time than pounding them by hand.
  - The *tenderizer* =嫩肉剂= was needed to grind the meat into small pieces.
  - Without a *pepper mill*, the woman was unable to grind small flakes of seasoning onto her dish.
  - He continued to wear down his teeth every time he began to grind them in his sleep.



* [[https://wordsinasentence.com/grope-in-a-sentence/][Grope]]

  =to feel around blindly for something=

  - The homeowner began to grope around in the dark in search of a flashlight or candle.
  - It was so dark in the shadowy alley that the woman had to grope around in her purse to find her keys.
  - Down in the dark well, the injured man continued to grope around for a way to escape.
  - Waking from a nightmare, the anxious dreamer would constantly grope around for a monster that wasn’t real.



* [[https://wordsinasentence.com/grudge-in-a-sentence/][Grudge]]

  =an intense feeling of dislike or animosity towards an individual who has treated you unfairly=

  - It’s hard to not hold a grudge against the girl who bullied me for four years in high school.
  - Because the veteran is finding it hard to get access to healthcare, he holds a grudge against his country.
  - I think my professor has a grudge against me because he never gives me top marks on my assignments.
  - Out of loyalty, most students of the state college hold a friendly grudge against the students of the state university.



* [[https://wordsinasentence.com/grumble-in-a-sentence/][Grumble]]

  =to whine about something=

  - Grandpa likes to grumble about how rude it is that children are always on their cellphones at the dinner table.
  - The waitress tended to grumble about how she was overworked, underpaid, and had to deal with horrible people everyday.
  - The mother didn't mean to grumble, but she was tired and her children refused to do their chores.
  - The students began to grumble and protest when their teacher assigned them a huge project over winter break.



* [[https://wordsinasentence.com/guile-in-a-sentence/][Guile]]

  =sly or cunning intelligence=

  - Although Britney pretends to be sweet and innocent, she has used her guile to become one of the most popular celebrities in the world.
  -  The wealthy man used his money and guile to get into politics.
  - If you want to win the competition, you will need to use your guile to beat the others.
  - Vivian used guile to trick the old man into giving her his money.
  - While Marshall has an attractive body, his guile and cruel personality make him unattractive as a person.
  - The priest is an honest man who does not use guile to deceive others.
  - In this military game, your guile is an asset.



* [[https://wordsinasentence.com/gullible-in-a-sentence/][Gullible]]

  =easily fooled or cheated=

  - The gullible woman gave all her money to a fake charity.
  - When the car salesman told me the price of the car was double its actual value, he obviously assumed I was a gullible idiot.
  - Gullible people tend to believe whatever they are told.
  - Unfortunately, the elderly woman was gullible enough to provide the con man with all of her financial information.
  - While Mary is not a gullible person, she did once give money to an individual who was merely pretending to be homeless to earn extra cash.
  - The stores hope to trick gullible consumers into buying expensive products that are no better in quality than their lower-priced counterparts.
  - Even the gullible audience was not impressed by the amateur magician’s tricks.



* [[https://wordsinasentence.com/gush-in-a-sentence/][Gush]]

  =to speak with extreme enthusiasm and often praise=

  - The exuberant mother loves to gush about her two children, praising them for literally everything and believing them to be incapable of wrong in any way.
  - If you gush too much about one person everyone will think you are obsessed with them for always singing their praises.
  - The most irritating fans of celebrities gush about them all the time, talking about them in every conversation and lauding them for simply existing.
  - It is completely normal for a parent to gush about their child from time to time, especially when they are performing well and truly do deserve some recognition.



* [[https://wordsinasentence.com/gabble-in-a-sentence/][Gabble]]

  =rapid and generally unintelligible speech=

  - The man’s hastily spoken words came out as little more than a gabble to the ears of both me and my spouse.
  - If you speak too quickly people will hear your words as nothing but a completely unintelligible gabble.
  - Many young children will attempt to speak quickly, but even slowly their words are usually unintelligible and therefore gabble.
  - A sentence is considered gabble when it is spoken too quickly for anyone to correctly interpret what has been said.



* [[https://wordsinasentence.com/gaffe-in-a-sentence/][Gaffe]]

  =an obvious error or mistake=

  - Because of the quarterback’s gaffe, our team lost the big game.
  - Clarice made a social gaffe when she wore jeans to a formal event.
  - After the actress tripped over her dress, she realized millions of people had seen her gaffe.
  - The blogger made a gaffe when he referred to the football player by another athlete's name.



* [[https://wordsinasentence.com/gaiety-in-a-sentence/][Gaiety]]

  =celebration; partying=

  - The gaiety is in honor of the principal’s retirement.
  - Because I am recovering from an illness, I do not feel like participating in the homecoming gaiety.
  - Jane does not have a *significant other* so she does not appreciate the gaiety of Valentine’s Day.
  - As an alcoholic, Tim tries to avoid the gaiety of holiday gatherings.



* [[https://wordsinasentence.com/gambol-in-a-sentence/][Gambol]]

  =jump or run in a playful manner=

  - Because of the rain, students are unable to gambol on the playground during recess.
  - My dog is always happy to gambol with the other *pooches* at the park.
  - To stay in shape, my husband likes to gambol along the beach every morning.
  - The children in my neighborhood hinder traffic when they gambol in the streets.



