ruby/G.org
* [[https://wordsinasentence.com/genteel-in-a-sentence/][Genteel]]

  =polite and well-mannered=

  - At the formal dinner, you are expected to behave in a genteel manner.
  - Beth’s parents sent her to a *finishing school* =女子精修学校= so she would learn how to become a genteel young woman.
  - Since this is supposed to be a genteel meeting, I will refrain from calling anyone mean names.
  - The judge was pleased by the genteel way the husband and wife treated each other during their divorce hearing.
  - When one attends a genteel social event, he or she should always bring a gift for the host.
  - Sarah’s genteel upbringing led her to open doors for elderly people.
  - Although Tony may dress like a *thug* =恶棍=, he is actually a genteel man with flawless manners.



* [[https://wordsinasentence.com/gesticulate-in-a-sentence/][Gesticulate]]

  =to express a thought using gestures=

  - When Jason got angry, he started to gesticulate his feelings with his hands.
  - The deaf woman tried frantically to gesticulate her fears to the police interpreter.
  - During the dance’s chase scene, the ballerina made use of her hands to gesticulate her distress.
  - The football coach used nonverbal signals to gesticulate plays to the quarterback.
  - While the monkey cannot respond in a verbal language understood by humans, he can gesticulate his wants and needs with physical motions.
  - The waiter was fired when the manager caught him waving a knife to gesticulate his feelings about a guest who not left a tip.
  - Whenever the scientist talked about his pet project, he would gesticulate his excitement by clasping and unclasping his hands.



* [[https://wordsinasentence.com/gild-in-a-sentence/][Gild]]

  =to make a light cover of gold or fake gold over something=

  - Jewelers have a tendency to gild cheaper rings, necklaces and bracelets with the least amount of authentic gold just so they can call it gold jewelry.
  - The painter would gild the painting of the woman’s dress on the canvas so that it would stand out with this flashy yellowish color.
  - On the invitations for couple’s wedding anniversary, the printers decided to gild the front of the invitations since it pertained to their 50th wedding anniversary.
  - For the golden tickets in the movie, Willie Wonka and the Chocolate Factory, someone would gild the tickets to make them appear real.



* [[https://wordsinasentence.com/gingerly-in-a-sentence/][Gingerly]]

  =gently=

  - After falling from the horse, he gingerly tried to stand on his throbbing foot, and found that he couldn’t.
  - After the dentist had done his work, she had to chew gingerly on that side of her mouth for a while.
  - Travis stepped gingerly on the ice, testing to see if it would hold his weight without breaking.
  - It was a hard hit, and the quarterback was getting up slowly and gingerly, testing for broken bones.
  - I gingerly opened the lid of the container, unsure of just how old the leftovers were.
  - Mara stepped gingerly over the shattered glass to get to the broom.
  - Paul got in the final punch, and he gingerly rubbed his jaw and checked for missing teeth.



* [[https://wordsinasentence.com/gist-in-a-sentence/][Gist]]

  =the main idea or point=

  - Because Ken told his story in a confusing way, I could not get the gist of it.
  - The first paragraph of the report should provide readers with the gist of the paper.
  - Since I heard the gist of my neighbors’ argument, I knew exactly why they were fighting.
  - The gist of my father’s speech was that I was grounded and could not attend my best friend’s party.



* [[https://wordsinasentence.com/glare-in-a-sentence/][Glare]]

  =A fierce and angry stare=

  - Giving off a killer stare, the icy inmate refused to let up his glare.
  - My husband’s angry glare was my first clue that he was really upset about something.
  - Even though I was surprised by my boss’s stern glare, I tried to avoid her stare and continue working.
  - The *frenemies* =亦敌亦友= continued to stare at each other at the lunch table, both refusing to give up their scowling glare.



* [[https://wordsinasentence.com/gleam-in-a-sentence/][Gleam]]

  =to shine brightly=

  - After they were waxed, the building’s floors seemed to gleam with brightness.
  - Anna’s eyes continued to gleam, shining brightly as she introduced her new baby to her family.
  - The dirty ring would probably gleam a lot brighter if it was cleaned properly.
  - Because he cleans it almost daily, the man’s truck seems to gleam with a brightness that makes it look brand new.



* [[https://wordsinasentence.com/glean-in-a-sentence/][Glean]]

  =to gather information in pieces=

  - From several library resources, Sara was able to glean enough information to write her research paper.
  - I was not able to glean much information from my uncle’s intoxicated ramblings.
  - During my chat with the famous educator, I was able to glean a wealth of knowledge about teaching.
  - The researchers were able to glean a great deal of information about the medicine’s effects during the experiment.
  - The elderly librarian cannot understand why students prefer to glean their facts from computers instead of from books.
  - An experienced eavesdropper, Kelly was able to easily glean information about the couple seated near us at dinner.
  - The company uses survey results to glean consumer opinions about their product line.



* [[https://wordsinasentence.com/glee-in-a-sentence/][Glee]]

  =intense happiness or joy=

  - Smiling with glee, the child unwrapped his birthday gift.
  - The glee that he was feeling showed through his twinkling eyes and bright smile.
  - Tasting her favorite cake brought both excitement and glee to the child’s heart.
  - Glee and joy could be heard in each song that the carolers sang.



