ruby/G.org
* [[https://wordsinasentence.com/glib-in-a-sentence/][Glib]]

  =speaking easily but without thinking carefully; speaking in a smooth, easy way that is insincere=

  - How could he have been so glib about such a traumatic event?
  - Because he is an expert at *dancing around* =转变环境= an issue with vague comments and glib one-liners, you never know when to take him seriously.
  - Considering the way he fills all his speeches with glib promises that he never follows through on, I’m amazed that he has any supporters at all.
  - By trying to show off and asking those glib questions, you’re just making yourself look more ignorant.
  - Although he had an easy, confident manner when they were together, she didn’t trust his glib promises.
  - I decided to stay home from the party because I just couldn’t suffer through another evening of glib chatter.
  - Because she is so conceited, Linda is constantly fishing for compliments, and she takes all the glib flattery seriously.



* [[https://wordsinasentence.com/glimmer-in-a-sentence/][Glimmer]]

  =a faint or flickering piece of something=

  - Even after several back to back losses, the boxer still had a glimmer of hope.
  - The Vaudeville show was gaudy and boring, but a glimmer of talent in the comedian kept the crowd coming back.
  - An unexpected check in the mail was a glimmer of good news after a long day at work.
  - There was only one glimmer of truth in the speech full of lies.



* [[https://wordsinasentence.com/glisten-in-a-sentence/][Glisten]]

  =to shine=

  - Rays began to glisten off the Hudson Bay as the morning sun rose over the water.
  - After a tough workout, sweat from his brow made the runner’s forehead glisten.
  - Admiring how her diamond would glisten in the sunlight, the newly engaged woman could barely believe how it shined.
  - Rain combined with the sun’s bright rays caused the mountainous trees to glisten and gleam.



* [[https://wordsinasentence.com/glitter-in-a-sentence/][Glitter]]

  =tiny pieces of reflective material that are usually used for decoration=

  - Glitter lined the girl’s fancy prom dress to help it sparkle in the light.
  - With a hint of silver glitter, the *drag queen’s* =男扮女装的男性同性恋者= sparkling eyes were as bright as her personality.
  - Gluing glitter onto the sign, the student hoped that her shimmering poster board would stand out from all the rest.
  - Adding glitter to her client’s nails, the technician hoped the metallic flakes would spice up her boring personality.



* [[https://wordsinasentence.com/gloomy-in-a-sentence/][Gloomy]]

  =dim; dismal=

  - Because the sky looked gloomy, I took an umbrella to work.
  - My retirement funds have decreased because of the gloomy economy.
  - During the funeral, the widow had a gloomy expression on her face.
  - The marathon is being cancelled because of the gloomy weather.



* [[https://wordsinasentence.com/glower-in-a-sentence/][Glower]]

  =to display a hostile stare on one’s face=

  - The police officers turned to glower at the suspect who had killed one of their own.
  - When the mean wrestler stopped to glower at the baby, everyone in the audience booed.
  - I could only glower at my rival as she tried out for my spot on the cheerleading squad.
  - If Janet did not glower so much, people would be more likely to approach her.
  - The security guard at the expensive jewelry store seemed to glower at me as I walked into the store wearing my ripped shirt and dirty jeans.
  - During the award show, Tianna tried not to glower as her rival accepted an award.
  - What did I do to make Ryan frown and glower at me all evening?



* [[https://wordsinasentence.com/gnaw-in-a-sentence/][Gnaw]]

  =to chew on something with persistence=

  - The dog started to gnaw on his leash.
  - When I get nervous, I sometimes gnaw on my fingernails.
  - The pest control specialist could see where the trapped mouse had started to gnaw through the wall.
  - Using her teeth, the hostage was able to gnaw through the rope.



* [[https://wordsinasentence.com/goad-in-a-sentence/][Goad]]

  =provoke or annoy (someone) so as to stimulate some action or reaction=

  - During lunch in the cafeteria today, my rival tried to goad me into a fight so I would get suspended from school.
  - My mother is going to try and goad her dog into getting off the bed by offering him a treat.
  - As a teacher, Joan was constantly looking for positive ways to goad her students into reading more.
  - The mobster used a picture of the bank president’s daughter to goad the official into robbing the bank.
  - On the ranch, dogs are used to goad the sheep into going in the right direction.
  - Teachers should stand in the hallways during class changes to goad students into promptly going inside their classrooms.
  - During the football game, some of the away team’s players tried to goad members of our team into fumbling the ball.



* [[https://wordsinasentence.com/gobbledygook-in-a-sentence/][Gobbledygook]]

  =complicated or technical language that is difficult to understand=

  - My geometry teacher was speaking English, but it was all gobbledygook to me.
  - Janet filled her term paper with gobbledygook to make it meet her teacher’s required word count.
  - American politics is just a lot of talking heads spouting a bunch of gobbledygook.
  - A baby can turn a perfectly good adult into a blathering idiot speaking pure gobbledygook in 3.5 seconds flat.



* [[https://wordsinasentence.com/gorge-in-a-sentence/][Gorge]]

  =to consume in huge amounts=

  - On Halloween night, most children *gorge on* candy.
  - My children are not allowed to gorge on sweets because they are bad for their teeth.
  - Now that my diet is over, I am so tempted to gorge at the nearest pizza buffet.
  - Because Anne is an excellent cook, it is easy to gorge on her food.



* [[https://wordsinasentence.com/gracious-in-a-sentence/][Gracious]]

  =courteous and kind=

  - The gracious hostess greeted everyone warmly.
  - When I met the princess, she was gracious and friendly despite her twelve-hour plane ride.
  - The gracious innkeeper greeted her guests with tea and cookies.
  - Although Jill does not like her ex-husband’s new wife, she is always gracious to her in public.



