ruby/G.org
* [[https://wordsinasentence.com/grate-in-a-sentence/][Grate]]

  =to shred a food item by moving it forcefully against a grater=

  - Please grate the lettuce for the tacos.
  - Before you put the cheese on the pizza, you should grate it so it will melt quicker.
  - Look away as you grate the onions into strips or you might start to cry.
  - Since the carrots are pretty large, my mom will probably grate them before putting them in the salad mix.



* [[https://wordsinasentence.com/grimace-in-a-sentence/][Grimace]]

  =a facial expression that usually indicates strong dislike or pain=

  - Whenever I think of the time I wasted with my cheating ex-girlfriend, I cannot help but feel a grimace forming on my face.
  - It is said that it takes more muscles to grimace than it does to smile.
  - Although Jenna said her ankle was fine, the grimace on her face told us her injury was serious.
  - A grimace crossed the basketball player’s face when he missed the crucial shot.
  - I struggle to hide a grimace whenever I see my mother-in-law.
  - After he ate my spinach casserole, my husband had a grimace of disgust on his face.
  - When she saw her ugly blind date, Maureen was unable to hide a grimace.



* [[https://wordsinasentence.com/grin-in-a-sentence/][Grin]]

  =a smile=

  - When he realized that he won the prize, a grin appeared on the man’s once sullen face.
  - The ecstatic bride could not hide her grin while coming down the aisle.
  - With a grin *from ear to ear*, the new mayor gave his *acceptance speech* =获奖感言=.
  - Smiling from the tree, the Cheshire Cat’s grin lit up the night sky.



* [[https://wordsinasentence.com/gripe-in-a-sentence/][Gripe]]

  =to complain=

  - The only thing the *finicky* patron could find to gripe about was the dull silverware.
  - Continuing to gripe, the boy’s mother followed him around his dirty room pointing out trash.
  - Teachers in the building would gripe about the laziness of the *janitorial* =看门的= staff.
  - With no one to gripe to, the irritated worker muttered and complained to himself.



* [[https://wordsinasentence.com/grisly-in-a-sentence/][Grisly]]

  =prompting panic or horror=

  - After the accident with the meat cutter, Katie refused to let anyone see her grisly face.
  - The girl screamed when she saw the grisly spider on her foot.
  - When the small animals heard the lion’s grisly roar, they ran and hid.
  - It takes the makeup artist several hours to apply the cosmetics that turn the actor into a grisly monster.



* [[https://wordsinasentence.com/grit-in-a-sentence/][Grit]]

  =bravery and mental strength=

  - The young boy’s grit kept him grounded during the two days he was lost in the forest.
  - Through grit and wits, the pioneers were able to survive the blizzard.
  - The former slave had grit that gave her courage to free other slaves.
  - Even though Erik sprained his ankle, his grit led him to finish the race.



* [[https://wordsinasentence.com/groan-in-a-sentence/][Groan]]

  =a low, mournful sound uttered in pain or grief=

  - The boy began to whimper groan about going to school, making his parents suspect that something was not right.
  - After hearing the sound of a painful groan, the men began to dig beneath the rubble hoping to locate the source of the sound.
  - Upon hearing that his brother would not make it through the night, Alex let out a mournful groan that brought tears to everyone’s eyes.
  - After watching the groan worthy movie, Jack admitted that its ratings were clearly mistaken.



* [[https://wordsinasentence.com/grotesque-in-a-sentence/][Grotesque]]

  =extremely ugly and strange=

  - Diego pressed his face against the window so that what we saw was a grotesque distortion resembled some alien life form.
  - After Becky told him she would never live in such a grotesque house for even a minute, Simon wondered how he was going to tell her he had already put a *down payment* =首付= on the *fixer-upper* =旧屋=.
  - As they chanted their spell, the three witches swayed around the fire in a grotesque dance.
  - Blanketed by the heavy fog, the branches of the trees assumed grotesque shapes that gave me a creepy feeling.
  - Although my mother protests strongly, Dad always *gets a kick out* =得到极大的乐趣= of scaring trick-or-treaters away with his grotesque mask.
  - It’s odd how we can find some grotesque things so fascinating.
  - When the psychologist heard some of the grotesque details of the murder, he realized that it had to have been the work of a psychopath.



* [[https://wordsinasentence.com/grouch-in-a-sentence/][Grouch]]

  =a moaner and complainer=

  - My teenager will often become a grouch by whining when I simply ask him to clean his room.
  - When many dissatisfied customers started sending their orders back to the chef, the grouch left the kitchen with his apron still on to yell at the customers.
  - I realized that my cat had turned into a grouch when she endlessly cried and meowed in my ear for no reason at all.
  - After asking the grouch sitting in the back of the classroom to answer the question, all the student did was whimper and make rude remarks.



* [[https://wordsinasentence.com/grove-in-a-sentence/][Grove]]

  =a typically isolated small group of trees=

  - While waves of grass made up the majority of the *open plains* =空旷草原=, there is a small grove made up of a dozen trees or so to the west.
  - A thousand trees is a forest, while a grove can be made up of just a handful of trees you could count on your fingers.
  - I am unsure of the difference between *a copse of trees* and a grove, but both are small groups of trees compared to a forest.
  - A grove of trees rarely has any underbrush, since the small number of trees result in less litter on the ground in the form of leaves.



* [[https://wordsinasentence.com/grovel-in-a-sentence/][Grovel]]

  =to be kind to someone in order to gain something=

  - The dog was willing to grovel for the biscuit.
  - When Rick won the lottery, all of his distant relatives started to grovel for his winnings.
  - The selfish king is amused when poor people grovel at his feet and ask for favors.
  - Because I refuse to grovel for anyone, I did not beg the politician for a personal favor.



