ruby/G.html



<div id="outline-container-orgdd2ed75" class="outline-2">
<h2 id="orgdd2ed75"><span class="section-number-2">65</span> <a href="https://wordsinasentence.com/grate-in-a-sentence/">Grate</a></h2>
<div class="outline-text-2" id="text-65">
<p>
<code>to shred a food item by moving it forcefully against a grater</code>
</p>

<ul class="org-ul">
<li>Please grate the lettuce for the tacos.</li>
<li>Before you put the cheese on the pizza, you should grate it so it will melt quicker.</li>
<li>Look away as you grate the onions into strips or you might start to cry.</li>
<li>Since the carrots are pretty large, my mom will probably grate them before putting them in the salad mix.</li>
</ul>
</div>
</div>



<div id="outline-container-org111cf9c" class="outline-2">
<h2 id="org111cf9c"><span class="section-number-2">66</span> <a href="https://wordsinasentence.com/grimace-in-a-sentence/">Grimace</a></h2>
<div class="outline-text-2" id="text-66">
<p>
<code>a facial expression that usually indicates strong dislike or pain</code>
</p>

<ul class="org-ul">
<li>Whenever I think of the time I wasted with my cheating ex-girlfriend, I cannot help but feel a grimace forming on my face.</li>
<li>It is said that it takes more muscles to grimace than it does to smile.</li>
<li>Although Jenna said her ankle was fine, the grimace on her face told us her injury was serious.</li>
<li>A grimace crossed the basketball player’s face when he missed the crucial shot.</li>
<li>I struggle to hide a grimace whenever I see my mother-in-law.</li>
<li>After he ate my spinach casserole, my husband had a grimace of disgust on his face.</li>
<li>When she saw her ugly blind date, Maureen was unable to hide a grimace.</li>
</ul>
</div>
</div>



<div id="outline-container-org175981d" class="outline-2">
<h2 id="org175981d"><span class="section-number-2">67</span> <a href="https://wordsinasentence.com/grin-in-a-sentence/">Grin</a></h2>
<div class="outline-text-2" id="text-67">
<p>
<code>a smile</code>
</p>

<ul class="org-ul">
<li>When he realized that he won the prize, a grin appeared on the man’s once sullen face.</li>
<li>The ecstatic bride could not hide her grin while coming down the aisle.</li>
<li>With a grin from ear to ear, the new mayor gave his acceptance speech.</li>
<li>Smiling from the tree, the Cheshire Cat’s grin lit up the night sky.</li>
</ul>
</div>
</div>



<div id="outline-container-org7a006e3" class="outline-2">
<h2 id="org7a006e3"><span class="section-number-2">68</span> <a href="https://wordsinasentence.com/gripe-in-a-sentence/">Gripe</a></h2>
<div class="outline-text-2" id="text-68">
<p>
<code>to complain</code>
</p>

<ul class="org-ul">
<li>The only thing the finicky patron could find to gripe about was the dull silverware.</li>
<li>Continuing to gripe, the boy’s mother followed him around his dirty room pointing out trash.</li>
<li>Teachers in the building would gripe about the laziness of the janitorial staff.</li>
<li>With no one to gripe to, the irritated worker muttered and complained to himself.</li>
</ul>
</div>
</div>



<div id="outline-container-org0de25e3" class="outline-2">
<h2 id="org0de25e3"><span class="section-number-2">69</span> <a href="https://wordsinasentence.com/grisly-in-a-sentence/">Grisly</a></h2>
<div class="outline-text-2" id="text-69">
<p>
<code>prompting panic or horror</code>
</p>

<ul class="org-ul">
<li>After the accident with the meat cutter, Katie refused to let anyone see her grisly face.</li>
<li>The girl screamed when she saw the grisly spider on her foot.</li>
<li>When the small animals heard the lion’s grisly roar, they ran and hid.</li>
<li>It takes the makeup artist several hours to apply the cosmetics that turn the actor into a grisly monster.</li>
</ul>
</div>
</div>



<div id="outline-container-org6cbb5a0" class="outline-2">
<h2 id="org6cbb5a0"><span class="section-number-2">70</span> <a href="https://wordsinasentence.com/grit-in-a-sentence/">Grit</a></h2>
<div class="outline-text-2" id="text-70">
<p>
<code>bravery and mental strength</code>
</p>

<ul class="org-ul">
<li>The young boy’s grit kept him grounded during the two days he was lost in the forest.</li>
<li>Through grit and wits, the pioneers were able to survive the blizzard.</li>
<li>The former slave had grit that gave her courage to free other slaves.</li>
<li>Even though Erik sprained his ankle, his grit led him to finish the race.</li>
</ul>
</div>
</div>



<div id="outline-container-org3016f12" class="outline-2">
<h2 id="org3016f12"><span class="section-number-2">71</span> <a href="https://wordsinasentence.com/groan-in-a-sentence/">Groan</a></h2>
<div class="outline-text-2" id="text-71">
<p>
<code>a low, mournful sound uttered in pain or grief</code>
</p>

<ul class="org-ul">
<li>The boy began to whimper groan about going to school, making his parents suspect that something was not right.</li>
<li>After hearing the sound of a painful groan, the men began to dig beneath the rubble hoping to locate the source of the sound.</li>
<li>Upon hearing that his brother would not make it through the night, Alex let out a mournful groan that brought tears to everyone’s eyes.</li>
<li>After watching the groan worthy movie, Jack admitted that its ratings were clearly mistaken.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb471950" class="outline-2">
<h2 id="orgb471950"><span class="section-number-2">72</span> <a href="https://wordsinasentence.com/grotesque-in-a-sentence/">Grotesque</a></h2>
<div class="outline-text-2" id="text-72">
<p>
<code>extremely ugly and strange</code>
</p>

<ul class="org-ul">
<li>Diego pressed his face against the window so that what we saw was a grotesque distortion resembled some alien life form.</li>
<li>After Becky told him she would never live in such a grotesque house for even a minute, Simon wondered how he was going to tell her he had already put a down payment on the fixer-upper.</li>
<li>As they chanted their spell, the three witches swayed around the fire in a grotesque dance.</li>
<li>Blanketed by the heavy fog, the branches of the trees assumed grotesque shapes that gave me a creepy feeling.</li>
<li>Although my mother protests strongly, Dad always gets a kick out of scaring trick-or-treaters away with his grotesque mask.</li>
<li>It’s odd how we can find some grotesque things so fascinating.</li>
<li>When the psychologist heard some of the grotesque details of the murder, he realized that it had to have been the work of a psychopath.</li>
</ul>
</div>
</div>



<div id="outline-container-orgeb43170" class="outline-2">
<h2 id="orgeb43170"><span class="section-number-2">73</span> <a href="https://wordsinasentence.com/grouch-in-a-sentence/">Grouch</a></h2>
<div class="outline-text-2" id="text-73">
<p>
<code>a moaner and complainer</code>
</p>

<ul class="org-ul">
<li>My teenager will often become a grouch by whining when I simply ask him to clean his room.</li>
<li>When many dissatisfied customers started sending their orders back to the chef, the grouch left the kitchen with his apron still on to yell at the customers.</li>
<li>I realized that my cat had turned into a grouch when she endlessly cried and meowed in my ear for no reason at all.</li>
<li>After asking the grouch sitting in the back of the classroom to answer the question, all the student did was whimper and make rude remarks.</li>
</ul>
</div>
</div>



<div id="outline-container-org3c2e046" class="outline-2">
<h2 id="org3c2e046"><span class="section-number-2">74</span> <a href="https://wordsinasentence.com/grove-in-a-sentence/">Grove</a></h2>
<div class="outline-text-2" id="text-74">
<p>
<code>a typically isolated small group of trees</code>
</p>

<ul class="org-ul">
<li>While waves of grass made up the majority of the open plains, there is a small grove made up of a dozen trees or so to the west.</li>
<li>A thousand trees is a forest, while a grove can be made up of just a handful of trees you could count on your fingers.</li>
<li>I am unsure of the difference between a copse of trees and a grove, but both are small groups of trees compared to a forest.</li>
<li>A grove of trees rarely has any underbrush, since the small number of trees result in less litter on the ground in the form of leaves.</li>
</ul>
</div>
</div>



<div id="outline-container-orge17ff4a" class="outline-2">
<h2 id="orge17ff4a"><span class="section-number-2">75</span> <a href="https://wordsinasentence.com/grovel-in-a-sentence/">Grovel</a></h2>
<div class="outline-text-2" id="text-75">
<p>
<code>to be kind to someone in order to gain something</code>
</p>

<ul class="org-ul">
<li>The dog was willing to grovel for the biscuit.</li>
<li>When Rick won the lottery, all of his distant relatives started to grovel for his winnings.</li>
<li>The selfish king is amused when poor people grovel at his feet and ask for favors.</li>
<li>Because I refuse to grovel for anyone, I did not beg the politician for a personal favor.</li>
</ul>
</div>
</div>
