ruby/G.org
* [[https://wordsinasentence.com/growl-in-a-sentence/][Growl]]

  =A low, threatening sound usually made by an animal=

  - Letting out a low growl, the dog let her owner know that someone was outside the door.
  - The tiger’s growl echoed through the jungle, alerting prey that the cat was on the hunt.
  - We heard a snarling growl in the bushes, but could not figure out what animal was making the *racket*.
  - Mila’s puppy will growl at her with a *drawn-out* =持续很久= *yap* 狂吠= when he’s ready for a snack.



* [[https://wordsinasentence.com/gruesome-in-a-sentence/][Gruesome]]

  =triggering disgust or horror=

  - The scary movie was filled with lots of gruesome scenes that made my stomach *queasy*.
  - When the little boy was ill, he vomited a gruesome mess on the floor.
  - Because of the haunted house’s gruesome special effects, the attraction is not suitable for young children.
  - Blood and body fragments covered the walls of the gruesome crime scene.



* [[https://wordsinasentence.com/gruff-in-a-sentence/][Gruff]]

  =severe in tone or manner=

  - Although the old man pretends to be gruff, he is really warm and kind.
  - The woman’s gruff response told me she wasn’t interested in purchasing a magazine subscription.
  - In a gruff voice, the police officer ordered the suspect out of his vehicle.
  - Hank’s gruff manner doesn’t fool anyone who knows his friendly nature.



* [[https://wordsinasentence.com/grumpy-in-a-sentence/][Grumpy]]

  =ill-tempered or unhappy=

  - I am always grumpy in the early morning, rarely saying a word and frowning at everyone who bothers to look my way.
  - My cat is always extremely grumpy if he isn’t fed on a regular basis, and he’ll make his displeasure known with his claws on my furniture.
  - When asked to pick out one of the most well-known grumpy figures in literature, the young student gave the honor to Ebenezer Scrooge.
  - My next door neighbor is a grumpy old man that never speaks to anyone, unless he’s yelling at kids to get off his lawn.



* [[https://wordsinasentence.com/guileless-in-a-sentence/][Guileless]]

  =naïve; trusting=

  - The guileless nerd really believed the prom queen had a crush on him.
  - Because the guileless old woman trusted everyone, she gave the scam artist her life savings.
  - The guileless man was so trusting he did not expect his girlfriend to cheat on him with his best friend.
  - When interviewed by the tabloid journalist, the guileless young actor shared too much information and soon came to regret it.



* [[https://wordsinasentence.com/guise-in-a-sentence/][Guise]]

  =the way that someone or something appears to people=

  - Under the guise of a police officer, the crook walked into the bank and easily robbed the tellers.
  - A fresh coat of paint will give our old house the guise of being brand new.
  - Today, many surveillance cameras are made in the guise of regular household objects so they will not be noticed.
  - Even though the store guard was dressed in the guise of a normal shopper, it was obvious he was a part of the store’s security team.
  - The terrorist entered the airport under the guise of an airline pilot.
  - When my rival volunteered to help me with my project, I knew her friendliness was nothing but a guise for an evil scheme.
  - To many, hip-hop music is just rap music under the guise of a different genre.



* [[https://wordsinasentence.com/gumption-in-a-sentence/][Gumption]]

  =ability and courage to get things done=

  - Building up the gumption to jump, the dare devil made his way to the edge of the cliff.
  - Do you really have the gumption to sing in front of a million people?
  - The boy had the admirable gumption to face his bully.
  - The runner’s grit and gumption helped him push forward when the run got difficult.
  - Not many of the dieters had the gumption to stick with the plan, but there were a few who didn’t quit.
  - Marla had the gumption to speak her mind even when others stayed silent.
  - Though his job paid well, he had the gumption to ask his penny-pinching boss for a raise.



* [[https://wordsinasentence.com/gustatory-in-a-sentence/][Gustatory]]

  =relating to taste=

  - The dinner was a gustatory pleasure for the palate.
  - The party included an array of gustatory desserts paired with wine.
  - The chef was trying to teach his students about the gustatory arts.
  - He suffered from an olfactory condition which eliminated any gustatory abilities.



* [[https://wordsinasentence.com/gyrate-in-a-sentence/][Gyrate]]

  =to move in a spiral or circular motion=

  - If you want the exotic dancer to gyrate especially for you, you’ll have to pay for a private dance.
  - The snake seemed to gyrate in the air before finally deciding to strike its prey.
  - Did you see the nasty girl gyrate against the stranger on the dance floor?
  - During the competition, the dancers will gyrate while twisting and turning on large *satin* ribbons.



#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>